*** Original perspective.el
#+BEGIN_SRC emacs-lisp
  ;; (use-package perspective
  ;;   :ensure t
  ;;   :bind (:map evil-normal-state-map
  ;;               ("SPC p r" . (lambda () (interactive)
  ;;                              (persp-state-load "~/.emacs.d/perspective_save")
  ;;                               (persp-switch "main"))))
  ;;   ;;             ("SPC TAB n" . persp-next)
  ;;   ;;             ("SPC TAB p" . persp-prev)
  ;;   ;;             ("SPC TAB s" . persp-switch)
  ;;   ;;             ("SPC b b" . persp-ivy-switch-buffer)
  ;;   ;;             ("SPC TAB d" . persp-kill))   ; or use a nicer switcher, see below
  ;;   :init
  ;;   (persp-mode)
  ;;   :config
  ;;   (setq persp-state-default-file "~/.emacs.d/perspective_save")
  ;;   ;; Load all perspectives from the save file, and enable persp-mode.
  ;;   ;; (persp-state-load "~/.emacs.d/perspective_save")
  ;;   ;; (persp-switch "main")
  ;;   ;; )))
  ;; ;;             ("SPC TAB n" . persp-next)
  ;; ;;             ("SPC TAB p" . persp-prev)
  ;; ;;             ("SPC TAB s" . persp-switch)
  ;; ;;             ("SPC b b" . persp-ivy-switch-buffer)
  ;; ;;             ("SPC TAB d" . persp-kill))   ; or use a nicer switcher, see below
  ;; :init
  ;; (persp-mode)
  ;; :config
  ;; (setq persp-state-default-file "~/.emacs.d/perspective_save")
  ;; ;; Load all perspectives from the save file, and enable persp-mode.
  ;; ;; (persp-state-load "~/.emacs.d/perspective_save")
  ;; ;; (persp-switch "main")
  ;; ;; Automatically save perspective session when Emacs exists.
  ;; (add-hook 'kill-emacs-hook #'persp-state-save)
  ;; )
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (persp-state-load ~/.emacs.d/perspective_save) |
** Evil - vim like navigation
Functions for evil binding
#+BEGIN_SRC emacs-lisp
  (defun kill-other-buffers ()
    "Kill all other buffers."
    (interactive)
    (mapc 'kill-buffer 
          (delq (current-buffer) 
                (remove-if-not 'buffer-file-name (buffer-list)))))
#+END_SRC
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t
    :after evil-leader
    :bind
    (:map evil-normal-state-map
          ("SPC ." . find-file)
          ("SPC h v" . describe-variable)
          ("SPC h f" . describe-function)
          ("SPC b O" . kill-other-buff)
          ("SPC o t" . vterm-toggle-cd)
          ("SPC t l" . global-display-line-numbers-mode)
          ("SPC RET" . counsel-bookmark)
          ("SPC b n" . evil-buffer-new)
          ("SPC q" . kill-current-buffer)
          ("SPC v l" . visual-line-mode)
          ("C-u" . evil-scroll-up)
          ;; ("SPC b b" . persp-ivy-switch-buffer)
          ("SPC b b" . persp-switch-to-buffer)
          ("SPC b B" . counsel-switch-buffer)
          ("SPC TAB d" . persp-kill)
          ("f" . avy-goto-char)
          ;; Perspective keybindings
          ("SPC TAB r" . persp-rename)
          ("SPC TAB n" . persp-next)
          ("SPC TAB p" . persp-prev)
          ;; ("SPC TAB s" . persp-switch)
          ("SPC TAB s" . persp-window-switch)
          ;; Frames
          ("SPC f b" . (lambda () (interactive) (switch-to-buffer-other-frame "*scratch*")))
          :map global-map
          ;; Org mode
          ("C-c t" . org-time-stamp-inactive)
          :map org-read-date-minibuffer-local-map
          ("C-j" . (lambda () (interactive)
                     (org-eval-in-calendar '(calendar-forward-week 1))))
          ("C-l" . (lambda () (interactive)
                     (org-eval-in-calendar '(calendar-forward-day 1))))
          ("C-k" . (lambda () (interactive)
                     (org-eval-in-calendar '(calendar-backward-week 1))))
          ("C-h" . (lambda () (interactive)
                     (org-eval-in-calendar '(calendar-backward-day 1))))
          )
    :init
    (setq evil-want-keybinding nil)
    :config
    (setq-default evil-kill-on-visual-paste nil)
    (global-evil-leader-mode 1)
    ;; (setq evil-want-C-u-scroll t)
    (evil-mode 1)
    )
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (org-eval-in-calendar '(calendar-backward-day 1)) |

#+BEGIN_SRC emacs-lisp
  (use-package evil-matchit
    :ensure t
    :after evil-mode
    :init
    ;; :config
    ;; (evilmi-load-plugin-rules '(mhtml-mode) '(ng2-html-mode ng2-html))
    ;; (evilmi-load-plugin-rules '(html-mode) '(ng2-html-mode ng2-html))
    )
  (evilmi-load-plugin-rules '(ng2-html-mode) '(html))
  (global-evil-matchit-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (evil-collection-init)
    (evil-define-key 'normal magit-mode-map "Z" 'magit-stash)
    (evil-define-key 'normal magit-mode-map "zz" 'evil-scroll-line-to-center)
    (evil-define-key 'normal magit-mode-map "zt" 'evil-scroll-line-to-top)
    (evil-define-key 'normal magit-mode-map "zb" 'evil-scroll-line-to-bottom)
    )
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (use-package evil-commentary
    :after evil
    :ensure t
    :config
    (evil-commentary-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :ensure t
    :defer 0.1
    :config (global-evil-surround-mode 1))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (use-package evil-leader
    :ensure t
    :defer 0.1
    :config
    (evil-leader/set-key
      "f" 'evil-find-char
      "b" 'evilem-motion-previous-line
      "p" 'prettier-prettify
      "k" 'save-buffer-without-dtw
  
      "d" 'dup-debug
  
      "o" 'org-mode
      "q" 'kill-current-buffer
      "v" 'vterm
      "`" 'vterm-toggle-cd
      "i" 'git-messenger:popup-message
      ;; "t" 'google-translate-at-point
      "t" 'google-translate-smooth-translate
      "T" 'google-translate-query-translate
  
      "a" 'counsel-org-agenda-headlines
      "c" 'dired-create-empty-file
      "p" 'my-format-all
      "s" 'publish-org-blog
      "g" 'dogears-go
  
      "h" 'lsp-ui-doc-show
      "e" 'lsp-treemacs-errors-list
      "r" 'treemacs-select-window
      "m" 'toggle-maximize-buffer
      )
  
    )
#+END_SRC

#+RESULTS:
: t

** Autoformat
#+BEGIN_SRC emacs-lisp
  (use-package prettier-js
    :ensure t
    :defer 0.1
    :hook ((ng2-html-mode . prettier-js-mode)
           (ng2-ts-mode . prettier-js-mode)
           (js-mode . prettier-js-mode))
    )

  (defun my-format-all ()
    "Format code and org mode blocks"
    (interactive)
    (if (and (eq major-mode 'org-mode)
             (org-in-src-block-p t))
        (format-org-mode-block)
      (format-all-ensure-formatter)
      (format-all-buffer)
      ))
  (use-package format-all
    :ensure t
    :defer 0.1
    :init
    (setq formatters '((typescript-mode . "prettier") (js-mode . "prettier") (go-mode "gofmt")))
    (format-all-mode 1))
#+END_SRC

#+RESULTS:
: [nil 0 0 100000 nil require (format-all nil t) idle 0]

** Org
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook (lambda ()
                             "Beautify Org Checkbox Symbol"
                             (push '("[ ]" .  "☐") prettify-symbols-alist)
                             (push '("[X]" . "☑" ) prettify-symbols-alist)
                             (push '("[-]" . "❍" ) prettify-symbols-alist)
                             (push '("#+BEGIN_SRC" . "↦" ) prettify-symbols-alist)
                             (push '("#+END_SRC" . "⇤" ) prettify-symbols-alist)
                             (push '("#+BEGIN_EXAMPLE" . "↦" ) prettify-symbols-alist)
                             (push '("#+END_EXAMPLE" . "⇤" ) prettify-symbols-alist)
                             (push '("#+BEGIN_QUOTE" . "↦" ) prettify-symbols-alist)
                             (push '("#+END_QUOTE" . "⇤" ) prettify-symbols-alist)
                             (push '("#+begin_quote" . "↦" ) prettify-symbols-alist)
                             (push '("#+end_quote" . "⇤" ) prettify-symbols-alist)
                             (push '("#+begin_example" . "↦" ) prettify-symbols-alist)
                             (push '("#+end_example" . "⇤" ) prettify-symbols-alist)
                             (push '("#+begin_src" . "↦" ) prettify-symbols-alist)
                             (push '("#+end_src" . "⇤" ) prettify-symbols-alist)
                             (prettify-symbols-mode)))

  (use-package org-indent
    :ensure nil
    :defer t
    :init
    (add-hook 'org-mode-hook 'org-indent-mode))

  (use-package ob-restclient
    :ensure t
    :defer 0.1)
  (defun format-org-mode-block ()
    "Format org mode code block"
    (interactive "p")
    ;; (execute-kbd-macro (kbd "C-c ' C-x h C-M-\\ C-c '"))
    ;; (execute-kbd-macro (read-kbd-macro "C-c ' C-x h C-M-\\ C-c '"))
     (org-edit-special)
     (format-all-ensure-formatter)
     (format-all-buffer)
     (org-edit-src-exit)
    )

  (use-package org
    :mode (("\\.org$" . org-mode))
    ;; :ensure t
    :ensure org-plus-contrib
    :defer 0.3
    ;; :demand t
    ;; :bind
    ;; (:map org-mode-map ("C-o f" . format-org-mode-block))
    :config
    (progn
      (define-key org-mode-map "\C-x a f" "\C-x h \C-M-\\ \C-c")
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((restclient . t)))
      (custom-set-faces
       '(org-level-1 ((t (:inherit outline-1 :height 2.0))))
       '(org-level-2 ((t (:inherit outline-2 :height 1.5))))
       '(org-level-3 ((t (:inherit outline-3 :height 1.25))))
       '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
       '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
       )
      (add-to-list 'org-tag-faces '("@.*" . (:foreground "red")))

      (org-babel-do-load-languages
       'org-babel-load-languages
       '((restclient . t)))


      (defun publish-org-blog()
        "Publish this note to du-blog!"
        (interactive)

        (message (concat
                  "node /Users/darkawower/projects/pet/it-blog/emacs-blog/index.js"
                  (buffer-file-name)))
        (shell-command
         (concat
          "node /Users/darkawower/projects/pet/it-blog/emacs-blog/index.js "
          (buffer-file-name))
         ))

      (setenv "NODE_PATH"
              (concat
               (getenv "HOME") "/org-node/node_modules"  ":"
               (getenv "NODE_PATH")
               )
              )

      (org-babel-do-load-languages
       'org-babel-load-languages
       '((js . t)))

      (defun org-babel-execute:typescript (body params)
        (let ((org-babel-js-cmd "npx ts-node < "))
          (org-babel-execute:js body params)))

      (defvar org-babel-js-function-wrapper
        ""
        "Javascript code to print value of body.")
      )
    )

  ;; (with-eval-after-load 'org
  ;;   (define-key org-mode-map "\C-x \Cp" ))
  #+END_SRC

  #+RESULTS:
  : ((.ts' . typescript-mode) (\.whl\' . python-mode) (\.pth\' . python-mode) (\.pyi\' . python-mode) (\.pyr\' . python-mode) (\.pxd\' . python-mode) (\.pyo\' . python-mode) (\.pyx\' . python-mode) (\.pyc\' . python-mode) (\.pym\' . python-mode) (\.py\' . python-mode) (\.vue\' . web-mode) (\.odc\' . archive-mode) (\.odf\' . archive-mode) (\.odi\' . archive-mode) (\.otp\' . archive-mode) (\.odp\' . archive-mode) (\.otg\' . archive-mode) (\.odg\' . archive-mode) (\.ots\' . archive-mode) (\.ods\' . archive-mode) (\.odm\' . archive-mode) (\.ott\' . archive-mode) (\.odt\' . archive-mode) (\.org$ . org-mode) (\(?:\(?:\.\(?:b\(?:\(?:abel\|ower\)rc\)\|json\(?:ld\)?\)\|composer\.lock\)\'\) . json-mode) (docker-compose[^/]*\.ya?ml\' . docker-compose-mode) (\.dockerfile\' . dockerfile-mode) (/Dockerfile\(?:\.[^/\]*\)?\' . dockerfile-mode) (go\.mod\' . go-dot-mod-mode) (\.go\' . go-mode) (Jenkinsfile\' . jenkinsfile-mode) (Jenkinsfile . groovy-mode) (\.g\(?:ant\|roovy\|radle\)\' . groovy-mode) (\.module.ts\' . ng2-ts-mode) (\.guard.ts\' . ng2-ts-mode) (\.directive.ts\' . ng2-ts-mode) (\.pipe.ts\' . ng2-ts-mode) (\.service.ts\' . ng2-ts-mode) (\.component.ts\' . ng2-ts-mode) (\.component.html\' . ng2-html-mode) (\.rs\' . rustic-mode) (\.\(?:md\|markdown\|mkd\|mdown\|mkdn\|mdwn\)\' . markdown-mode) (/git-rebase-todo\' . git-rebase-mode) (\.ts\' . typescript-mode) (\.\(e?ya?\|ra\)ml\' . yaml-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.\(?:3fr\|a\(?:rw\|vs\)\|bmp[23]?\|c\(?:als?\|myka?\|r[2w]\|u[rt]\)\|d\(?:c[mrx]\|ds\|ng\|px\)\|exr\|f\(?:ax\|its\)\|gif\(?:87\)?\|hrz\|ic\(?:on\|[bo]\)\|j\(?:2c\|ng\|p\(?:eg\|[2cg]\)\)\|k\(?:25\|dc\)\|m\(?:iff\|ng\|rw\|s\(?:l\|vg\)\|tv\)\|nef\|o\(?:rf\|tb\)\|p\(?:bm\|c\(?:ds\|[dltx]\)\|db\|ef\|gm\|i\(?:ct\|x\)\|jpeg\|n\(?:g\(?:24\|32\|8\)\|[gm]\)\|pm\|sd\|tif\|wp\)\|r\(?:a[fs]\|gb[ao]?\|l[ae]\)\|s\(?:c[rt]\|fw\|gi\|r[2f]\|un\|vgz?\)\|t\(?:ga\|i\(?:ff\(?:64\)?\|le\|m\)\|tf\)\|uyvy\|v\(?:da\|i\(?:car\|d\|ff\)\|st\)\|w\(?:bmp\|pg\)\|x\(?:3f\|bm\|cf\|pm\|[cv]\)\|y\(?:cbcra?\|uv\)\)\' . image-mode) (\.elc\' . elisp-byte-code-mode) (\.zst\' nil jka-compr) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Brew\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (\.py[iw]?\' . python-mode) (\.m\' . octave-maybe-mode) (\.less\' . less-css-mode) (\.scss\' . scss-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.h\' . c-or-c++-mode) (\.c\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . mhtml-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.dir-locals\(?:-2\)?\.el\' . lisp-data-mode) (eww-bookmarks\' . lisp-data-mode) (tramp\' . lisp-data-mode) (/archive-contents\' . lisp-data-mode) (places\' . lisp-data-mode) (\.emacs-places\' . lisp-data-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\.\(scm\|stk\|ss\|sch\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-bsdmake-mode) (\.make\' . makefile-bsdmake-mode) (GNUmakefile\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-bsdmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (/PKGBUILD\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|zshrc\|m?kshrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\(acinclude\|aclocal\|acsite\)\.m4\' . autoconf-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|cbr\|7z\|squashfs\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|CBR\|7Z\|SQUASHFS\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.js[mx]?\' . javascript-mode) (\.har\' . javascript-mode) (\.json\' . javascript-mode) (\.[ds]?va?h?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|DVI\|OD[FGPST]\|DOCX\|XLSX?\|PPTX?\|pdf\|djvu\|dvi\|od[fgpst]\|docx\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (/\.\(authinfo\|netrc\)\' . authinfo-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.la\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\.toml\' . conf-toml-mode) (\.desktop\' . conf-desktop-mode) (/\.redshift\.conf\' . conf-windows-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.\(?:asound\|enigma\|fetchmail\|gltron\|gtk\|hxplayer\|mairix\|mbsync\|msmtp\|net\|neverball\|nvidia-settings-\|offlineimap\|qt/.+\|realplayer\|reportbug\|rtorrent\.\|screen\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|mpdconf\|notmuch-config\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.art\' . image-mode) (\.avs\' . image-mode) (\.bmp\' . image-mode) (\.cmyk\' . image-mode) (\.cmyka\' . image-mode) (\.crw\' . image-mode) (\.dcr\' . image-mode) (\.dcx\' . image-mode) (\.dng\' . image-mode) (\.dpx\' . image-mode) (\.fax\' . image-mode) (\.hrz\' . image-mode) (\.icb\' . image-mode) (\.icc\' . image-mode) (\.icm\' . image-mode) (\.ico\' . image-mode) (\.icon\' . image-mode) (\.jbg\' . image-mode) (\.jbig\' . image-mode) (\.jng\' . image-mode) (\.jnx\' . image-mode) (\.miff\' . image-mode) (\.mng\' . image-mode) (\.mvg\' . image-mode) (\.otb\' . image-mode) (\.p7\' . image-mode) (\.pcx\' . image-mode) (\.pdb\' . image-mode) (\.pfa\' . image-mode) (\.pfb\' . image-mode) (\.picon\' . image-mode) (\.pict\' . image-mode) (\.rgb\' . image-mode) (\.rgba\' . image-mode) (\.tga\' . image-mode) (\.wbmp\' . image-mode) (\.webp\' . image-mode) (\.wmf\' . image-mode) (\.wpg\' . image-mode) (\.xcf\' . image-mode) (\.xmp\' . image-mode) (\.xwd\' . image-mode) (\.yuv\' . image-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.tzst\' . tar-mode))

